{
    "vacancies": [
        {
            "id": 1,
            "category": "kitchen",
            "position": "Шеф-повар",
            "description": "Шеф-повар является визитной карточкой заведения, в котором он работает. Его первейшая обязанность – придумывать рецепты уникальных блюд. Новизна, экзотичность, свежий взгляд на привычные кушанья – именно этого ждут от шеф-повара. Для того чтобы справиться с этой задачей, ему необходимо иметь широчайший кругозор в области кулинарии, а также иметь выдающееся обоняние и чувство вкуса. Нелишним будет и развитая фантазия. Шеф-повар – это начальник кухни, у него в подчинении находится множество помощников и других поваров."
        },
        {
            "id": 2,
            "category": "delivery",
            "position": "Курьер на автомобиле",
            "description": "Кабанчик на моторе."
        },
        {
            "id": 3,
            "category": "delivery",
            "position": "Пеший курьер",
            "description": "Простой кабанчик."
        },
        {
            "id": 4,
            "category": "delivery",
            "position": "Пеший курьер",
            "description": "Простой кабанчик."
        },
        {
            "id": 5,
            "category": "service",
            "position": "Сомелье",
            "description": "Эксперт по вопросам приобретения, хранения и подачи вина к столу. Сомелье составляет винную карту, занимается дегустацией вин, даёт рекомендации по выбору напитков иобеспечивает их грамотную подачу клиентам."
        },
        {
            "id": 6,
            "category": "managment",
            "position": "Управляющий",
            "description": "Главная обязанность менеджера ресторана – управление заведением от имени владельцев. В течение дня он решает самые разные задачи, начиная от консультации с шеф-поваром по поводу меню на день и заканчивая проверкой готовности кухни к выполнению заказов. Профессиональный управляющий не ограничивается общением с персоналом, он беседует с расположенными к разговору посетителями, чтобы понять, все ли их устраивает."
        }
    ]
}